{
  "architectures": [
    "RobertaForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": 2,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "Spam / Kh\u00f4ng li\u00ean quan",
    "1": "Khen ng\u1ee3i / T\u01b0\u01a1ng t\u00e1c t\u00edch c\u1ef1c",
    "2": "H\u1ecfi th\u00f4ng tin s\u1ea3n ph\u1ea9m",
    "3": "Kh\u1ea9n c\u1ea5p / C\u1ea7n ph\u1ea3n h\u1ed3i nhanh",
    "4": "H\u1ecfi v\u1eadn chuy\u1ec3n / Thanh to\u00e1n",
    "5": "H\u1ecfi gi\u00e1",
    "6": "Ph\u00e0n n\u00e0n / Ti\u00eau c\u1ef1c",
    "7": "Ch\u1ed1t \u0111\u01a1n / Mua h\u00e0ng"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "Ch\u1ed1t \u0111\u01a1n / Mua h\u00e0ng": 7,
    "H\u1ecfi gi\u00e1": 5,
    "H\u1ecfi th\u00f4ng tin s\u1ea3n ph\u1ea9m": 2,
    "H\u1ecfi v\u1eadn chuy\u1ec3n / Thanh to\u00e1n": 4,
    "Khen ng\u1ee3i / T\u01b0\u01a1ng t\u00e1c t\u00edch c\u1ef1c": 1,
    "Kh\u1ea9n c\u1ea5p / C\u1ea7n ph\u1ea3n h\u1ed3i nhanh": 3,
    "Ph\u00e0n n\u00e0n / Ti\u00eau c\u1ef1c": 6,
    "Spam / Kh\u00f4ng li\u00ean quan": 0
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 258,
  "model_type": "roberta",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "tokenizer_class": "PhobertTokenizer",
  "transformers_version": "4.56.1",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 64001
}
